jmeter/HTMLreport/statistics.json
{
  "TCP Sampler" : {
    "transaction" : "TCP Sampler",
    "sampleCount" : 1863,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.856146001073494,
    "medianResTime" : 18.0,
    "minResTime" : 4.0,
    "maxResTime" : 100.0,
    "pct1ResTime" : 22.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 30.0,
    "throughput" : 15.657304220664615,
    "receivedKBytesPerSec" : 3.538256010686131,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1863,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.856146001073494,
    "medianResTime" : 18.0,
    "minResTime" : 4.0,
    "maxResTime" : 100.0,
    "pct1ResTime" : 22.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 30.0,
    "throughput" : 15.657304220664615,
    "receivedKBytesPerSec" : 3.538256010686131,
    "sentKBytesPerSec" : 0.0
  }
}